const OrderTerms = () => {
    return (
      <div className="font-bn">
        <h4 className="font-semibold sm:text-lg md:text-xl">শর্তাবলী</h4>
        <p className="mt-4 text-justify text-xs">
          গ্রাহকদের সর্বোচ্চ সেবা নিশ্চিত করতে রকমারিতে রয়েছে সুবিশাল ইনভেন্টরি।
          স্টকে না থাকা প্রোডাক্টগুলো সাপ্লায়ারের নিকট থেকে সংগ্রহ করতে হয় -{" "}
          <br />
          1. আপনার অর্ডারের প্রোডাক্টগুলো সাপ্লায়ারের কাছে না থাকলে সেগুলো ব্যাতিত
          অবশিষ্ট প্রোডাক্টগুলো পাঠিয়ে দেয়া হবে। এসব ক্ষেত্রে আপনাকে
          ইমেইল/এসএমএস/হোয়াটসঅ্যাপ/ফোন এর মাধ্যমে জানিয়ে দেয়া হবে। <br /> 2.
          আপনার পেইড অর্ডারের প্রোডাক্ট NA হলে অথবা ক্যান্সেল হলে পেইড এমাউন্ট
          ৭-১০ কর্মদিবসের মাঝে রিফান্ড করা হবে ইনশাআল্লাহ। <br /> 3. সাপ্লায়ারের
          পক্ষ থেকে প্রোডাক্টের মূল্য পরিবর্তন হতে পারে। এসব ক্ষেত্রে আপনাকে
          ইমেইল/এসএমএস/হোয়াটসঅ্যাপ/ফোন এর মাধ্যমে জানিয়ে দেয়া হবে।
        </p>
      </div>
    );
  };

export default OrderTerms;