import { MiscHeader } from '@/micro-components';

const TermsAndConditions = () => {
  return (
    <div>
      <MiscHeader
        title="Terms and Conditions"
        subtitle="Terms of service — what you need to know"
      />
      <div className="layout-container layout-px text-sm lg:text-base">
        <section className="layout-mt p-4 sm:p-6 md:p-8 lg:p-10 bg-white">
          <h2 className="text-lg font-bold">Order Policy:</h2>
          <ul className="mt-2 list-disc ml-4 space-y-2 font-bn">
            <li>
              পাঠক পয়েন্ট নতুন ও পুরাতন বই বিক্রি করে। তবে ওয়েবসাইটে প্রদর্শিত
              সকল নতুন বই পাঠক পয়েন্টের স্টকে নাও থাকতে পারে। আপনার অর্ডার করা
              কোনো নতুন বই স্টকে না থাকলে, তা প্রকাশকের কাছ থেকে সংগ্রহ করে
              আপনার কাছে পাঠানো হবে। যদি কোনো নতুন বই স্টকে বা প্রকাশকের কাছেও
              না থাকে অর্থাৎ প্রিন্ট-আউট হয়ে যায়, তাহলে পাঠক পয়েন্ট সেই বইটি
              সরবরাহ করতে পারবে না।
            </li>
            <li>
              পাঠক পয়েন্টের ওয়েবসাইটে প্রদর্শিত সকল পুরাতন বই পাঠক পয়েন্টের
              স্টকে থাকে। যদি কোনো বইয়ে ভুল তথ্য, পেইজ মিসিং, বা পাঠ অযোগ্য
              অবস্থা থাকে, তাহলে পাঠক পয়েন্ট সেই অর্ডারকৃত বইটি সরবরাহ করবে না।
            </li>
            <li>
              পাঠক পয়েন্ট বইয়ের বিবরণ সঠিকভাবে দেওয়ার সর্বোচ্চ চেষ্টা করে। তবে
              পুরাতন বইয়ের ক্ষেত্রে কোনো বইয়ের সাথে ওয়েবসাইটের বিবরণের অমিল
              থাকলে, প্যাকেজিং বিভাগের পক্ষ থেকে প্যাকেজিংয়ের পূর্বে ভিডিও
              পাঠানো হবে এবং অমিলের বিষয়টি জানানো হবে। তখন অর্ডারকারী চাইলে বইটি
              পরিবর্তন, বাদ, বা পুরো অর্ডারটি ক্যান্সেল করতে পারবেন।
            </li>
            <li>
              পুরাতন বই অর্ডারের ক্ষেত্রে, ওয়েবসাইটের ছবির সাথে প্রাপ্ত বইয়ের
              মিল নাও থাকতে পারে, কারণ ওয়েবসাইটে ব্যবহৃত ছবিটি প্রতীকী। এজন্যই
              পাঠক পয়েন্ট প্যাকেজিংয়ের পূর্বে বইয়ের কোয়ালিটি নিশ্চিত করতে ভিডিও
              পাঠিয়ে থাকে।
            </li>
          </ul>
        </section>
        <section className="layout-mt p-4 sm:p-6 md:p-8 lg:p-10 bg-white">
          <h2 className="text-lg font-bold">Delivery Policy:</h2>
          <ul className="mt-2 list-disc ml-4 space-y-2 font-bn text-justify">
            <li>
              <strong>ঢাকার ভিতর:</strong> ঢাকা শহরের মধ্যে হোম ডেলিভারির সময়
              1-3 পূর্ণ কার্যদিবস। তবে ঢাকা জেলার বাইরে, শহরের বাহিরের
              স্থানগুলোতে ডেলিভারির সময় 2-5 পূর্ণ কার্যদিবস।
            </li>
            <li>
              <strong>ঢাকার বাহিরে:</strong> ঢাকার বাইরে জেলা শহরে ডেলিভারির সময়
              3-7 পূর্ণ কার্যদিবস।
            </li>
            <li>
              <strong>উপজেলা ও গ্রামাঞ্চল:</strong> উপজেলা ও গ্রামাঞ্চলে
              ডেলিভারি চ্যানেল অনুযায়ী 3-7 পূর্ণ কার্যদিবসের মধ্যে পণ্য ডেলিভারি
              হয়ে থাকে। তবে কিছু ক্ষেত্রে প্রত্যন্ত অঞ্চলে ডেলিভারি দেওয়া সম্ভব
              নাও হতে পারে; সেক্ষেত্রে ক্রেতাকে উপজেলা বাজার বা পরিচিত কোনো
              জায়গা থেকে পার্সেলটি গ্রহণ করতে হতে পারে।
            </li>
            <li>
              <strong>হোম ডেলিভারি:</strong> হোম ডেলিভারির সময়, স্থান, শহর ও
              সার্ভিস অনুযায়ী পাঠক পয়েন্ট বিভিন্ন ডেলিভারি চ্যানেলের মাধ্যমে
              পণ্য পাঠিয়ে থাকে। স্থান বা দুর্যোগের কারণে কখনও হোম ডেলিভারিতে
              সমস্যা দেখা দিতে পারে; এ অবস্থায় ক্রেতার নির্দিষ্ট স্থানে হোম
              ডেলিভারি সম্ভব নাও হতে পারে।
            </li>
            <li>
              <strong>কুরিয়ার:</strong> জেলা ও সার্ভিস অনুযায়ী পাঠক পয়েন্ট
              সুন্দরবন কুরিয়ার সার্ভিস ব্যবহার করে।
            </li>
            <li>
              <strong>ডেলিভারি চার্জ:</strong> পাঠক পয়েন্ট সাইট থেকে বই ক্রয়ের
              সময় ক্রেতার নির্বাচিত ডেলিভারি পদ্ধতি অনুযায়ী ডেলিভারি চার্জ সাইটে
              দেখানো হবে। এছাড়া বিভিন্ন অফারের জন্য ডেলিভারি চার্জ কম-বেশি হতে
              পারে, তাই এখানে শিপিং চার্জ সুনির্দিষ্টভাবে উল্লেখ করা হচ্ছে না।
            </li>
          </ul>
        </section>
        <section className="layout-mt p-4 sm:p-6 md:p-8 lg:p-10 bg-white">
          <h2 className="text-lg font-bold">Pricing Policy:</h2>
          <ul className="mt-2 list-disc ml-4 space-y-2 font-bn text-justify">
            <li>
              <strong>নতুন বইয়ের মূল্য:</strong> আমাদের সাইটে থাকা নতুন বইয়ের
              মুদ্রিত মূল্য সাধারণত প্রকাশকের কাছ থেকে নেওয়া হয়। আমরা সর্বদা
              চেষ্টা করি যাতে বইয়ের বিক্রিত বা মুদ্রিত মূল্য সঠিক থাকে। তবে
              অনাকাঙ্ক্ষিত কারণে কখনও কখনও এই দাম ভুল হতে পারে। উদাহরণস্বরূপ,
              সাপ্লায়ার অসাবধানতাবশত আমাদের বইয়ের দাম পরিবর্তনের বিষয়টি জানাতে
              নাও পারেন, বা প্রডাক্টের দাম দেওয়ার সময় ভুল দাম দিতে পারেন। তাই
              বইয়ের দামে ভুল হওয়া সম্পূর্ণভাবে নিয়ন্ত্রণ করা সবসময় সম্ভব নয়।
            </li>
            <li>
              <strong>পুরাতন বইয়ের মূল্য:</strong> পুরাতন বইয়ের মূল্য পাঠক
              পয়েন্ট নির্ধারণ করে থাকে এবং এই ক্ষেত্রে মুদ্রিত মূল্য বিবেচনা করা
              হয় না। পুরাতন এডিশনের বইগুলোর মুদ্রিত মূল্য সব সময় বিবেচনা করা
              সম্ভব হয় না। কিছু বইয়ের মুদ্রিত মূল্য 1/2/7 টাকা হতে পারে, এর জন্য
              পাঠক পয়েন্ট নির্ধারিত পুরাতন মূল্য মুদ্রিত মূল্যের চেয়ে বেশিও হতে
              পারে। তাই, কোনো বইয়ের পুরাতন মূল্য যদি মুদ্রিত মূল্যের চেয়ে বেশি
              হয়, তবে এরকম অভিযোগ গ্রহণযোগ্য নয়। পুরাতন বইয়ের মূল্য নির্ভর করে
              বইয়ের বর্তমান মূল্য, কোয়ালিটি, এডিশন ইত্যাদির উপর। বর্তমান মূল্য
              ভেদে পুরাতন বইয়ের মূল্য নতুন বইয়ের 40-80% কম দাম হতে পারে।
            </li>
            <li>
              <strong>মূল্যের ভুল:</strong> নতুন বইয়ের মূল্যের ভুল হলে আমরা
              চাইলে আপনাকে বইয়ের ভুল দাম সম্পর্কে জানাতে পারি, অথবা প্রয়োজন হলে
              অর্ডারটি বাতিল করতে পারি (কোনো কারণে সরাসরি অর্ডার বাতিলের
              প্রয়োজন হলে আমরা আপনাকে অবহিত করব)। উল্লেখ্য যে, অর্ডার বাতিল
              করার ক্ষেত্রে পাঠক পয়েন্টের সিদ্ধান্তই চূড়ান্ত হবে। অর্ডার নিশ্চিত
              হওয়া বা ইতিমধ্যে পেমেন্ট সম্পন্ন হওয়া সত্ত্বেও এটি প্রযোজ্য।
              গ্রাহক যদি পূর্বে পেমেন্ট করে থাকেন, তাহলে সাধারণ রিফান্ড পলিসি
              অনুযায়ী আমরা গ্রাহকের পরিশোধিত মূল্য ফেরত দেব।
            </li>
            <li>
              <strong>ডেলিভারির পর মূল্য জানানো:</strong> পণ্য ডেলিভারি হওয়ার পর
              যদি জানতে পারেন ওয়েবসাইটে বইয়ের গায়ের/প্রচ্ছদ মূল্য/নির্ধারিত
              মূল্য/বিক্রিত মূল্য ভুল ছিল, তাহলে অনুগ্রহ করে আমাদেরকে 7 দিনের
              মধ্যে জানাবেন। অতিরিক্ত রাখা হলে আমরা আপনাকে সাধারণ পলিসি অনুযায়ী
              অতিরিক্ত মূল্য রিফান্ড করব। 7 দিন পর জানালে আমরা ধরে নেব বইয়ের দাম
              সঠিক ছিল, কারণ অতিরিক্ত সময় পার হলে সঠিক মূল্য যাচাই করা কঠিন হয়ে
              পড়ে।
            </li>
          </ul>
        </section>
        <section className="layout-mt p-4 sm:p-6 md:p-8 lg:p-10 bg-white">
          <h2 className="text-lg font-bold">Refund Policy:</h2>
          <ul className="mt-2 list-disc ml-4 space-y-2 font-bn text-justify">
            <li>
              <strong>অর্ডার বাতিল:</strong> আপনার পেইড অর্ডারটি ক্যান্সেল হলে
              কিংবা গ্রাহক নিজে ক্যান্সেল করতে অনুরোধ করলে সম্পূর্ণ মূল্য
              রিফান্ড দেয়া হবে।
            </li>
            <li>
              <strong>ডেলিভারি না হলে রিফান্ড:</strong> পেইড অর্ডার ডেলিভারি না
              হলে কিংবা ডেলিভারি হওয়ার পূর্বেই রিটার্ন এলে সম্পূর্ণ মূল্য
              রিফান্ড দেয়া হবে। কাস্টমার যদি নতুন করে অর্ডারটি ডেলিভারি নিতে
              চান, এক্ষেত্রে নতুন করে পাঠানো হবে।
            </li>
            <li>
              <strong>পার্সেল রিসিভ না হলে:</strong> কাস্টমারের সমস্যার কারণে
              কোনো পার্সেল রিসিভ করতে না পারলে এবং প্রিপেইড অর্ডার হলে নতুন করে
              ডেলিভারি চার্জ পেমেন্ট করতে হবে, অন্যথায় পার্সেলটি পুনরায় পাঠানো
              হবেনা।
            </li>
            <li>
              <strong>মিসিং বইয়ের রিফান্ড:</strong> পেইজ মিসিং কিংবা পাঠ-অযোগ্য
              কোনো বই পাঠকের হাতে পৌছালে ৭ দিনের মধ্যে জানাতে হবে। পাঠক পয়েন্ট
              সমস্যাটি বিবেচনা করে সর্বোচ্চ বইয়ের মূল্য রিফান্ড করতে পারে।
              সেক্ষেত্রে পাঠ-অযোগ্য বইটি ফেরত পাঠানো লাগবেনা।
            </li>
            <li>
              <strong>সুন্দরবন কুরিয়ার:</strong> সুন্দরবন কুরিয়ারের ক্ষেত্রে
              অগ্রিম ফুল পেমেন্ট করতে হবে এবং কোনো কারণে অর্ডারকারী অর্ডারটি
              ক্যান্সেল করতে চাইলে ফুল টাকা রিফান্ড দেয়া হবে। কোনো বই বাদ দিতে
              চাইলে সে বইয়ের মূল্য রিফান্ড করা হবে।
            </li>
            <li>
              <strong>ক্যাশ অন ডেলিভারি:</strong> পাঠক পয়েন্ট পার্শিয়াল ক্যাশ অন
              ডেলিভারি দিয়ে থাকে অর্থাৎ ক্যাশ অন ডেলিভারি সিলেক্ট করলে অগ্রিম
              ১০০ টাকা পেমেন্ট করতে হবে এবং বাকী টাকা ডেলিভারি ম্যানের কাছে দিতে
              হবে। বই পছন্দ না হলে কিংবা বইগুলো ডেলিভারিতে দেয়ার আগে কোনো কারণে
              অর্ডার ক্যান্সেল করলে অর্ডারকারী ১০০ টাকা রিফান্ড পাবেন।
            </li>
            <li>
              <strong>অনলাইন পেমেন্ট:</strong> অনলাইন পেমেন্টের ক্ষেত্রে
              টেকনিক্যাল ভুলের কারণে যদি বেশি টাকা কেটে রাখা হয়, তাহলে যথাযথ
              প্রমাণ প্রদানপূর্বক অতিরিক্ত অর্থ ফেরত দেওয়া হবে।
            </li>
            <li>
              <strong>অতিরিক্ত টাকা ফেরত:</strong> অনলাইন পেমেন্টের ক্ষেত্রে
              গ্রাহক বইয়ের মূল্যের চেয়ে অতিরিক্ত টাকা পেমেন্ট করে থাকলে, অথবা
              পেইড অর্ডারের কোনো বই যদি স্টকে না থাকার কারণে অর্ডার থেকে বাদ
              দেয়া হয়, তবে সেক্ষেত্রে মোট মূল্যের অতিরিক্ত টাকা গ্রাহককে রিফান্ড
              করে দেয়া হবে।
            </li>
            <li>
              <strong>ক্যাশব্যাক অফার:</strong> ক্যাশব্যাক অফার চলাকালীন কোনো
              কারণে অর্ডার ক্যান্সেল করলে পাঠক পয়েন্ট কর্তৃপক্ষ আপনাকে
              ক্যাশব্যাকের এমাউন্টটি বাদ দিয়ে অর্ডারের পেমেন্ট রিফান্ড করবে।
            </li>
            <li>
              <strong>রিফান্ড প্রক্রিয়া:</strong> রিফান্ড প্রসেস করতে সাধারণত
              ২-৩ দিন সময় লাগে। যদি এর মাঝে রিফান্ড না পান, তাহলে আমাদের সাথে
              যোগাযোগ করবেন।
            </li>
            <li>
              <strong>রিফান্ড মাধ্যম:</strong> রিফান্ড সাধারণত আমরা মোবাইল
              ব্যাংকিং এর মাধ্যমে করে থাকি; যেমন: বিকাশ, রকেট, নগদ।
            </li>
          </ul>
        </section>
      </div>
    </div>
  );
};

export default TermsAndConditions;
